TELL_ME/app/Models/CommentModel.php

    public function getComments($postId)
{
    return $this->select('comments.*, user.username') // Select fields from comments and the username
                ->join('user', 'user.user_id = comments.user_id') // Join user table on user_id
                ->where('comments.post_id', $postId) // Filter by post_id
                ->findAll(); // Return all comments for the post
---
SELECT `comments`.*, `user`.`username`
FROM `comments`
JOIN `user` ON `user`.`user_id` = `comments`.`user_id`
WHERE `comments`.`post_id` = '11'