TELL_ME/app/Controllers/Auth.php

INSERT INTO `user` (`username`, `email`, `password`) VALUES ('ayam09', 'ayam09@gmail.com', '$2y$10$zsiHlxBepB23RPpbDBGutOr7Ui3DhA7F/BZHmpbmAYQ0Q5Vg3Y85a')
---
            ];

            $userModel = new UserModel();
            $query = $userModel->insert($values);