TELL_ME/app/Controllers/Auth.php

            ];

            $userModel = new \App\Models\UserModel();
            $query = $userModel->insert($values);
---
INSERT INTO `user` (`username`, `email`, `password`) VALUES ('intan', 'intan@gmail.com', '$2y$10$ZSHZ/L4iXcrdQeYuWql.yeHIbp/l1N3vHh/T87NEhfZv3Bid9TZTm')