TELL_ME/app/Controllers/Auth.php

    public function login()
    {
        $session = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'zuzu_0904'
 LIMIT 1

    public function dashboard()
    {
        // Instantiate PostModel
        $postModel = new PostModel();
        // Ambil posts dan join dengan tabel user untuk mendapatkan username
        $posts = $postModel->select('posts.*, user.username') // Select fields from posts and username from users
            ->join('user', 'user.user_id = posts.user_id')  // Join users table on user_id
            ->findAll();

        // Instantiate LikeModel
        $likeModel = new LikeModel();
        // Hitung jumlah like untuk setiap post
        foreach ($posts as &$post) {
            $post['like_count'] = $likeModel->where('post_id', $post['post_id'])->countAllResults();
---
SELECT `posts`.*, `user`.`username`
FROM `posts`
JOIN `user` ON `user`.`user_id` = `posts`.`user_id`
SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `post_id` = '11'