TELL_ME/app/Controllers/Notif.php

SELECT *
FROM `notifications`
WHERE `user_id` = '3'
---
    public function index()
    {
        // Ambil ID pengguna dari session
        $userId = session()->get('user_id');

        // Inisialisasi model notifikasi
        $notificationModel = new NotificationModel();

        // Ambil notifikasi untuk pengguna
        $data['notifications'] = $notificationModel->where('user_id', $userId)->findAll();