TELL_ME/app/Controllers/PostController.php

    public function create()
    {
        $userId = session()->get('user_id');

        $postText = $this->request->getPost('post_text');

        // Validasi input
        if (empty($postText)) {
            return redirect()->back()->with('error', 'Post text cannot be empty');
        }

        // Simpan post ke database
        $model = new PostModel();
        $data = [
            'user_id' => $userId,  // ID pengguna yang sedang login
            'content' => $postText,
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s'),
        ];

        if ($model->save($data)) {
---
INSERT INTO `posts` (`user_id`, `content`, `created_at`, `updated_at`) VALUES ('2', 'ff', '2024-12-09 16:35:03', '2024-12-09 16:35:03')